app/controllers/admin/categorias_controller.rb

SELECT * FROM `categorias`
---
  def index
    @categorias = Categoria.all