app/controllers/admin/dashboard_controller.rb

  def index
    @categorias = Categoria.all
---
SELECT * FROM `categorias`