app/controllers/admin/produtos_controller.rb

SELECT * FROM `produtos`
---
  def index
    @produtos = Produto.all

SELECT * FROM `produtos` WHERE (`produtos`.`permalink` = 'prtese-equipamentos-monojato-sem-exaustor-vh-equipamentos') LIMIT 1
---
  def show
    @produto = Produto.find_by_permalink(params[:id])

SELECT * FROM `produtos` WHERE (`produtos`.`permalink` = 'monojato-sem-exaustor-vh-equipamentos') LIMIT 1
---
  def edit
    @produto = Produto.find_by_permalink(params[:id])

SELECT `produtos`.id FROM `produtos` WHERE (permalink = 'prtese-equipamentos-monojato-sem-exaustor-vh-equipamentos' and id != 2) LIMIT 1
UPDATE `produtos` SET `updated_at` = '2010-04-13 03:19:55', `permalink` = 'prtese-equipamentos-monojato-sem-exaustor-vh-equipamentos', `titulo` = 'Prótese Equipamentos - Monojato sem exaustor - VH EQUIPAMENTOS' WHERE `id` = 2
---
  def update
    @produto = Produto.find_by_permalink(params[:id])
    if @produto.update_attributes(params[:produto])

SELECT * FROM `produtos` WHERE (`produtos`.`permalink` = 'monojato-sem-exaustor-vh-equipamentos-2') LIMIT 1
DELETE FROM `produtos` WHERE `id` = 3
---
  def destroy
    @produto = Produto.find_by_permalink(params[:id])
    @produto.destroy