app/controllers/categorias_controller.rb

SELECT * FROM `categorias` WHERE (`categorias`.`permalink` = 'alta-baixa-rotacao-nsk') LIMIT 1
---
  def show
    @categoria = Categoria.find_by_permalink(params[:id])