app/controllers/paginas_controller.rb

SELECT * FROM `paginas`
---
  def index
    @carousel = true
    @paginas = Pagina.all