app/controllers/produtos_controller.rb

SELECT * FROM `produtos` WHERE (`produtos`.`permalink` = 'prtese-equipamentos-monojato-sem-exaustor-vh-equipamentos') LIMIT 1
---
  def show
    @produto = Produto.find_by_permalink(params[:id])